Revit 2027 API
WorksharingSaveAsOptions.ClearTransmitted Property
 For a transmitted model opened with DetachAndPreserveWorksets, clear its transmitted flag in the Save/SaveAs operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ClearTransmitted { get; set; }
Public Property ClearTransmitted As Boolean
	Get
	Set
public:
property bool ClearTransmitted {
	bool get ();
	void set (bool value);
}
member ClearTransmitted : bool with get, set
Property Value
Boolean
See Also
Reference
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace